app/controllers/wscolores_controller.rb

SELECT "colors".* FROM "colors"
---
  def leer3
    @colores = Color.all

SELECT "colors".* FROM "colors" WHERE "colors"."id" = ? LIMIT 1  [["id", 1]]
---
  def colordia
    @colores = Color.find(2)